#+TAGS: WORK FAMILY PERSONAL
* Inbox

** CANCELLED [#B] http://cs2.swfc.edu.cn/~wx672/lecture_notes/linux/latex/latex_tutorial.html
   CLOSED: [2017-03-13 Mon 13:05]
   :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2017-03-13 Mon 13:05] \\
     尋思,暫時不需要學習 latex 語法,分散了學習時間
   :END:
** TODO [#B] make sure which item affect the connection in my /etc/resolv.conf
   in my /etc/reslov.conf , i added 4 items, i wana know which really make my chrome
   connect to google.
   1. commant "search vpn"?
   2. commant "8.8.8.8"
   3. ...
** SOMEDAY [#B] 通讀子龍的emacs配置                               :spacemacs:

** TODO [#B] 學習如何給chrome capture的文章做腳注筆記
   SCHEDULED: <2017-03-13 Mon 09:00>
   :PROPERTIES:
   :Effort:   10
   :END:

** TODO [#B] 明天要詳細理解,肢解後歸檔代碼                  :emacs:hack:code:
   SCHEDULED: <2017-03-13 Mon 09:30>
   :PROPERTIES:
   :Effort:   30
   :END:
[[file:journal.org::*%E5%A4%A7%E7%A5%9E%E6%94%B9%E9%80%B2elfeed%E7%9A%84%E9%A1%8F%E8%89%B2%E9%A1%AF%E7%A4%BA,%E4%B8%A6%E5%A2%9E%E5%8A%A0%E6%89%93%E5%88%86%E5%8A%9F%E8%83%BD][大神改進elfeed的顏色顯示,並增加打分功能]]

** TODO [#B] 昨天沒有解決給elfeed entry 打分並高亮
   SCHEDULED: <2017-03-13 Mon 10:00>
[[file:~/.spacemacs.d/layers/zilongshanren-misc/packages.el::;;%20yiddi:add%20to%20customize%20the%20appearance%20of%20elfeed]]
LOGBOO:
1. 我開始在 zilong 配置中增加了 elfeed
2. 此後就一直出現, elfeed-feeds 被重置的問題
3. 這一次打分程序無效
4. 我就又把elfeed 從子龍的生命packages中刪除了
END:

** TODO [#C] 給老哥電話訂家具
   SCHEDULED: <2017-03-14 Tue 14:00>
** STARTED [#B] 下午房子砸牆，陽臺
   SCHEDULED: <2017-03-12 Sun 16:00>
** STARTED [#C] 溝通解決新城窗戶莊歪問題
   SCHEDULED: <2017-03-13 Mon 13:00>

** TODO [#B] 整理 journal.org 中的所有文章格式整理,美化,並歸檔

** TODO [#B] 這個問題沒有解決,代碼是正確的,但elfeed-scratch中並沒有顯示出效果
[[file:~/.spacemacs.d/layers/zilongshanren-misc/packages.el::;;%20starting%20point.][大神定制elfeeed entry顏色顯示]]

** TODO [#B] 查看那天觀看用emacs進行科學研究的youtube視頻
   重點在於,他用了哪些包,以此來擴展一下自己的視野

** TODO [#A] 繼續整理自己的全知識doc
   DEADLINE: <2017-03-13 Mon 11:30> SCHEDULED: <2017-03-14 Tue 08:00>

** STARTED [#B] 學習skeleton-mode                                  :PERSONAL:
   DEADLINE: <2017-03-14 Tue 16:00> SCHEDULED: <2017-03-14 Tue 14:00>
   :LOGBOOK:
   CLOCK: [2017-03-15 Wed 09:56]--[2017-03-15 Wed 13:12] =>  3:16
   CLOCK: [2017-03-15 Wed 09:49]--[2017-03-15 Wed 09:53] =>  0:04
   CLOCK: [2017-03-15 Wed 09:25]--[2017-03-15 Wed 09:34] =>  0:09
   CLOCK: [2017-03-14 Tue 09:41]--[2017-03-14 Tue 11:41] =>  2:00
   CLOCK: [2017-03-14 Tue 06:58]--[2017-03-14 Tue 07:43] =>  0:45
   SOME-TIPS:
         1. checklists are good for making sure that you complete tasks more
            consistently, not missing any important steps. you can work faster
            when there’s a guide, since you don’t have to keep thinking of the
            next step each time. The simple act of checking things off can
            encourage you to put in more effort, since the list shows you your
            progress. It also makes it easier to remember to follow up.
         2. 用鏈接來組織筆記架構,用鏈接來記錄每天任務的完成列表存檔

   :END:

** TODO [#B] 搞清楚pandoc-mode是怎麼運行的,最好能實現自動化把html轉爲org
   比如一旦發現download文件中出現html,就自動轉換爲某個文件夾下的org

** TODO [#B] 找個模板能讓 src-block 裏的代碼背景色高粱

** TODO [#B] appointment好像起作用了,看看他是如何工作的.
   我記得應該是加在 org zilong package 位置的代碼,關於 reminder的.
   他是12min before 提醒的,彈出了一個小buffer左下角,持續了幾秒鍾,消失了
   看看如何設置
   13:48左右

** STARTED [#B] TEST
#+BEGIN_SRC emacs-lisp
(org-clock-in)
(org-clock-is-active)
#+END_SRC

** TODO 學習這種思想

         1. Checklists are good for making sure that you complete tasks more
            consistently, not missing any important steps. You can work faster
            when there’s a guide, since you don’t have to keep thinking of the
            next step each time. The simple act of checking things off can
            encourage you to put in more effort, since the list shows you your
            progress. It also makes it easier to remember to follow up.
         2. 用鏈接來組織筆記架構,用鏈接來記錄每天任務的完成列表存檔

** TODO [#B] 監工窗臺維修進度, 2017-03-15.
   SCHEDULED: <2017-03-17 Fri 09:30>
   如果兩天還沒開始動工,就警告租房補償.
   他有可能在消極怠工,拖時間.反正我就耗着,你也得住.
   這樣,我們已經累積溝通好幾次了.這個問題必須搞好.反正現在都流行上訪投訴.
   再不行我就打315,也剛過去沒幾天.你看着辦,我現在也不要賠償,你就給我把窗戶
   弄好.

** TODO [#B]

** TODO [#B] 應該把學習編程當成翻譯課,每天練習翻譯
   SCHEDULED: <2017-03-16 Thu 09:00>
